## mpg.csv

manufacturer: 자동차 제조사 이름. "Toyota", "Ford", "Honda" 등
model: 자동차 모델명. "Camry", "F-150", "Accord" 등
displ: 엔진 배기량(displacement). 일반적으로 리터(liter) 단위로 표시.
year: 자동차 생산 연도. 
cyl: 엔진 실린더 수. 
trans: 변속기 종류. 
drv: 구동 방식. 전륜 구동(Front Wheel Drive), 후륜 구동(Rear Wheel Drive), 4륜 구동(Four Wheel Drive) 등
cty: 도시 주행 연비(city miles per gallon).
hwy: 고속도로 주행 연비(highway miles per gallon).
fl: 자동차 연료 타입.
category: 자동차의 크기 또는 유형을 나타내는 분류. "compact", "midsize", "suv" 등

In [1]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd
import numpy as np
import csv
import folium
import matplotlib.pyplot as plt
plt.rc('font',family='D2CodingLigature Nerd Font')

In [2]:
mpg = pd.read_csv('../../data/mpg.csv')
mpg.head(3)

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact

In [3]:
mpg.groupby('manufacturer')[['cty']].mean()

                    cty
manufacturer
audi          17.611111
chevrolet     15.000000
dodge         13.135135
ford          14.000000
honda         24.444444
hyundai       18.642857
jeep          13.500000
land rover    11.500000
lincoln       11.333333
mercury       13.250000
nissan        18.076923
pontiac       17.000000
subaru        19.285714
toyota        18.529412
volkswagen    20.925926

In [ ]:
# 제조회사별(manufacturer), 구동방식별(drv) cty 평균

mpg.groupby(['manufacturer', 'drv'])['cty'].mean()

manufacturer  drv
audi          4      16.818182
              f      18.857143
chevrolet     4      12.500000
              f      18.800000
              r      14.100000
dodge         4      12.000000
              f      15.818182
ford          4      13.307692
              r      14.750000
honda         f      24.444444
hyundai       f      18.642857
jeep          4      13.500000
land rover    4      11.500000
lincoln       r      11.333333
mercury       4      13.250000
nissan        4      13.750000
              f      20.000000
pontiac       f      17.000000
subaru        4      19.285714
toyota        4      14.933333
              f      21.368421
volkswagen    f      20.925926
Name: cty, dtype: float64

In [11]:
# 제조회사별(manufacturer), 구동방식별(drv) cty 평균과 빈도

mpg.groupby(['manufacturer', 'drv']).agg(cty_mean=('cty', 'mean'), cty_count=('cty', 'count'))

                   cty_mean  cty_count
manufacturer drv
audi         4    16.818182         11
             f    18.857143          7
chevrolet    4    12.500000          4
             f    18.800000          5
             r    14.100000         10
dodge        4    12.000000         26
             f    15.818182         11
ford         4    13.307692         13
             r    14.750000         12
honda        f    24.444444          9
hyundai      f    18.642857         14
jeep         4    13.500000          8
land rover   4    11.500000          4
lincoln      r    11.333333          3
mercury      4    13.250000          4
nissan       4    13.750000          4
             f    20.000000          9
pontiac      f    17.000000          5
subaru       4    19.285714         14
toyota       4    14.933333         15
             f    21.368421         19
volkswagen   f    20.925926         27

In [12]:
## 구동방식(drv)별, hwy의 평균 및 빈도

mpg.groupby('drv').agg(hwy_mean=('hwy', 'mean'), hwy_count=('hwy', 'count'))

      hwy_mean  hwy_count
drv
4    19.174757        103
f    28.160377        106
r    21.000000         25

In [17]:
# audi의 drv별 빈도

mpg.query('manufacturer == "audi"').groupby('drv').agg(drv_count=('drv', 'count'))

     drv_count
drv
4           11
f            7

In [20]:
## SUV 데이터에서 제조사별 연비( cty와 hwy  ) 평균 내림차순
# 1. suv 데이터 추출
# 2. 평균계산( (cty+hwy)/2 )
# 3. 제조사별 평균 기준 내림차순

mpg.query('category == "suv"').assign( t = (mpg['cty'] + mpg['hwy']) /2).groupby('manufacturer').agg(mean_t = ('t', 'mean')).sort_values('mean_t', ascending=False)

                 mean_t
manufacturer
subaru        21.916667
toyota        16.312500
nissan        15.875000
mercury       15.625000
jeep          15.562500
ford          15.333333
chevrolet     14.888889
lincoln       14.166667
land rover    14.000000
dodge         13.928571